#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEnd

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FrontEnd.FrontEnd_C
// 0x00E8 (0x0478 - 0x0390)
class UFrontEnd_C final : public UFortUIStateWidget_Frontend
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBottomBarWidget_C*                     BottomBar;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                BottomBarSizedSpacer;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonPTT;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonToggleChat;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChatWidget_C*                          ChatWidget;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MainAreaDarken;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetStack*                     MainContentStack;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxPTT;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTopBar_C*                              TopBar;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                TopBarSizedSpacer;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          PlayedCurrentEventMovie;                           // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          StartedPlayingVideo;                               // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         CampaignScriptedActions;                           // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                         PostSubgameScriptedActions;                        // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          HasBeenDeferringSurvivorSquadAutoSlottedNotification; // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<EFortStoreState>                         StoreStatesThatDeferSurvivorSquadAutoSlottingNotifications; // 0x0418(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   AthenaEventVideoID;                                // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TrailerMovieIndex;                                 // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FrontEnd(int32 EntryPoint);
	void ToggleBars(bool Hide);
	void HandleStoreStateChanged(EFortStoreState NewStoreState);
	void HandleSurvivorSquadsAutoSlotted();
	void OnMovieFinished();
	void On_Social_Import_Closed();
	void OnEnterState(EFortUIState PreviousUIState);
	void HandleQuestsGranted(const TArray<class UFortQuestItem*>& Quests);
	void On_Can_PTT();
	void BndEvt__ButtonPTT_K2Node_ComponentBoundEvent_138_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_39_CommonSelectedStateChanged__DelegateSignature(class UCommonButton* Button, bool Selected);
	void HandleQuestsCompleted(const TArray<class UFortQuestItem*>& Quests);
	void BndEvt__ButtonToggleChat_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Loading_Screen_Changed(bool IsVisible_0);
	void Construct();
	void RequestOpenSocialMenu();
	void HandleClientEvent_NotPlayingEventMovie(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_EventMovieFinishedPlaying(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void HandleClientEvent_FinishedModalWindows(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void DailyRewardsTokenGranted();
	void Destruct();
	void OnExitState(EFortUIState NextUIState);
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void HandleLobbyDisconnected();
	struct FEventReply On_MainAreaDarken_MouseButtonUp(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void HandleMainMenuStateChanged(bool Index_0);
	void RegisterScriptedActions(EFortUIState InPreviousUIState);
	void SetHeaderVisibility(bool Visible);
	void SetFooterVisibility(bool Visible);
	void HandleEnterFrontend(EFortUIState UIState);
	void BindDelegates();
	void HandleQuestRewardClaimed(class UFortQuestItem* Quest, TArray<struct FFortItemInstanceQuantityPair>& Rewards);
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void HandlePopContentStackOp();
	void UnbindDelegates();
	void HandleWidgetStackChanged(class UWidget* Widget, int32 ActiveWidgetIndex);
	void GetActiveTab(class FName* ActiveTab);
	void InitForSubGame();
	void SetChatWidgetVisibility(bool Visible);
	void UpdateVisibilityState(bool HideHeader, bool HideFooter, bool HideChat);
	void NeedsToPlayEventMovie(bool* NeedsToPlayEventMovie_0);
	void PlayEventMovieIfNecessary(bool* PlayingEventMovie);
	void SetOverlayTitleBarVisibility(bool Visible);
	void UpdatePttVisibility(EPTTState PTTState);
	void InitChatVisibilityButton();
	void PlayTrailer(int32 VideoIndex);
	void IsPrototyping(bool* Result);
	bool IsCampaign();
	void RegisterPostSubGameScriptedActions();
	void SetupSafeZones(class UAthenaTabsScreen_C* AthenaTabsScreen);
	void QueueSurvivorSquadsAutoSlottedNotification();
	void LoadTrailer(class UFortActivatableVideoPanel* ActivatableMovieWidget, int32 VideoIndex, bool* Return_Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEnd_C">();
	}
	static class UFrontEnd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrontEnd_C>();
	}
};
static_assert(alignof(UFrontEnd_C) == 0x000008, "Wrong alignment on UFrontEnd_C");
static_assert(sizeof(UFrontEnd_C) == 0x000478, "Wrong size on UFrontEnd_C");
static_assert(offsetof(UFrontEnd_C, UberGraphFrame) == 0x000390, "Member 'UFrontEnd_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, BottomBar) == 0x000398, "Member 'UFrontEnd_C::BottomBar' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, BottomBarSizedSpacer) == 0x0003A0, "Member 'UFrontEnd_C::BottomBarSizedSpacer' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, ButtonPTT) == 0x0003A8, "Member 'UFrontEnd_C::ButtonPTT' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, ButtonToggleChat) == 0x0003B0, "Member 'UFrontEnd_C::ButtonToggleChat' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, ChatWidget) == 0x0003B8, "Member 'UFrontEnd_C::ChatWidget' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, MainAreaDarken) == 0x0003C0, "Member 'UFrontEnd_C::MainAreaDarken' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, MainContentStack) == 0x0003C8, "Member 'UFrontEnd_C::MainContentStack' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, SizeBoxPTT) == 0x0003D0, "Member 'UFrontEnd_C::SizeBoxPTT' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, TopBar) == 0x0003D8, "Member 'UFrontEnd_C::TopBar' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, TopBarSizedSpacer) == 0x0003E0, "Member 'UFrontEnd_C::TopBarSizedSpacer' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, PlayedCurrentEventMovie) == 0x0003E8, "Member 'UFrontEnd_C::PlayedCurrentEventMovie' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, StartedPlayingVideo) == 0x0003E9, "Member 'UFrontEnd_C::StartedPlayingVideo' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, CampaignScriptedActions) == 0x0003F0, "Member 'UFrontEnd_C::CampaignScriptedActions' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, PostSubgameScriptedActions) == 0x000400, "Member 'UFrontEnd_C::PostSubgameScriptedActions' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, HasBeenDeferringSurvivorSquadAutoSlottedNotification) == 0x000410, "Member 'UFrontEnd_C::HasBeenDeferringSurvivorSquadAutoSlottedNotification' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, StoreStatesThatDeferSurvivorSquadAutoSlottingNotifications) == 0x000418, "Member 'UFrontEnd_C::StoreStatesThatDeferSurvivorSquadAutoSlottingNotifications' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, AthenaEventVideoID) == 0x000468, "Member 'UFrontEnd_C::AthenaEventVideoID' has a wrong offset!");
static_assert(offsetof(UFrontEnd_C, TrailerMovieIndex) == 0x000470, "Member 'UFrontEnd_C::TrailerMovieIndex' has a wrong offset!");

}

